lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queuePendingApsFrameExtended(NodeEntry* node, uint8_t deliveryMode,
                                  uint16_t destinationGroup,
                                  uint16_t clusterId, uint16_t profileId,
                                  uint8_t destinationEndpoint,
                                  uint8_t sourceEndpoint,
                                  const uint8_t* payload,
                                  uint8_t payloadLength) {
  if (node == nullptr) {
    return false;
  }
  if (payloadLength > 0U && payload == nullptr) {
    return false;
  }
  if (node->pendingAssociationResponse || node->pendingTransportKey ||
      node->pendingSwitchKey || node->pending.used ||
      payloadLength > kPendingPayloadMax) {
    return false;
  }

  node->pending.used = true;
  node->pending.deliveryMode = deliveryMode;
  node->pending.destinationGroup = destinationGroup;
  node->pending.clusterId = clusterId;
  node->pending.profileId = profileId;
  node->pending.destinationEndpoint = destinationEndpoint;
  node->pending.sourceEndpoint = sourceEndpoint;
  node->pending.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(node->pending.payload, payload, payloadLength);
  }
  return true;
}

bool queuePendingApsFrame(NodeEntry* node, uint16_t clusterId,
                          uint16_t profileId, uint8_t destinationEndpoint,
                          uint8_t sourceEndpoint, const uint8_t* payload,
                          uint8_t payloadLength) {
  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryUnicast, 0U, clusterId, profileId,
      destinationEndpoint, sourceEndpoint, payload, payloadLength);
}

void clearPendingApsAck(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  node->pendingApsAck = false;
  node->pendingApsAckCounter = 0U;
  node->pendingApsAckClusterId = 0U;
  node->pendingApsAckProfileId = 0U;
  node->pendingApsAckDestinationEndpoint = 0U;
  node->pendingApsAckSourceEndpoint = 0U;
  node->pendingApsAckRetriesRemaining = 0U;
  node->pendingApsAckDeadlineMs = 0U;
  node->inFlight.used = false;
  node->inFlight.payloadLength = 0U;
}

void clearRecentInboundAps(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  memset(&node->recentInboundAps, 0, sizeof(node->recentInboundAps));
}

void rememberPendingApsAck(NodeEntry* node, const ZigbeeApsDataFrame& aps,
                           const uint8_t* payload, uint8_t payloadLength) {
  if (node == nullptr || aps.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !aps.ackRequested || payloadLength > sizeof(node->inFlight.payload) ||
      (payloadLength > 0U && payload == nullptr)) {
    clearPendingApsAck(node);
    return;
  }
  node->pendingApsAck = true;
  node->pendingApsAckCounter = aps.counter;
  node->pendingApsAckClusterId = aps.clusterId;
  node->pendingApsAckProfileId = aps.profileId;
  node->pendingApsAckDestinationEndpoint = aps.destinationEndpoint;
  node->pendingApsAckSourceEndpoint = aps.sourceEndpoint;
  node->pendingApsAckRetriesRemaining = kApsAckRetryLimit;
  node->pendingApsAckDeadlineMs = millis() + kApsAckTimeoutMs;
  node->inFlight.used = true;
  node->inFlight.deliveryMode = aps.deliveryMode;
  node->inFlight.destinationGroup = aps.destinationGroup;
  node->inFlight.clusterId = aps.clusterId;
  node->inFlight.profileId = aps.profileId;
  node->inFlight.destinationEndpoint = aps.destinationEndpoint;
  node->inFlight.sourceEndpoint = aps.sourceEndpoint;
  node->inFlight.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(node->inFlight.payload, payload, payloadLength);
  }
}

bool matchesPendingApsAck(const NodeEntry& node,
                          const ZigbeeApsAcknowledgementFrame& ack) {
  return node.pendingApsAck && ack.valid && !ack.ackFormatCommand &&
         ack.counter == node.pendingApsAckCounter &&
         ack.clusterId == node.pendingApsAckClusterId &&
         ack.profileId == node.pendingApsAckProfileId &&
         ack.destinationEndpoint == node.pendingApsAckSourceEndpoint &&
         ack.sourceEndpoint == node.pendingApsAckDestinationEndpoint;
}

void rememberRecentInboundAps(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }
  node->recentInboundAps.valid = true;
  node->recentInboundAps.counter = aps.counter;
  node->recentInboundAps.clusterId = aps.clusterId;
  node->recentInboundAps.profileId = aps.profileId;
  node->recentInboundAps.destinationEndpoint = aps.destinationEndpoint;
  node->recentInboundAps.sourceEndpoint = aps.sourceEndpoint;
  node->recentInboundAps.deliveryMode = aps.deliveryMode;
  node->recentInboundAps.expiresMs = millis() + kRecentInboundApsWindowMs;
}

bool isRecentInboundApsDuplicate(NodeEntry* node, const ZigbeeApsDataFrame& aps,
                                 uint32_t nowMs) {
  if (node == nullptr || !node->recentInboundAps.valid ||
      static_cast<int32_t>(nowMs - node->recentInboundAps.expiresMs) >= 0) {
    clearRecentInboundAps(node);
    return false;
  }
  return node->recentInboundAps.counter == aps.counter &&
         node->recentInboundAps.clusterId == aps.clusterId &&
         node->recentInboundAps.profileId == aps.profileId &&
         node->recentInboundAps.destinationEndpoint == aps.destinationEndpoint &&
         node->recentInboundAps.sourceEndpoint == aps.sourceEndpoint &&
         node->recentInboundAps.deliveryMode == aps.deliveryMode;
}

bool sendNwkCommand(NodeEntry* node, const uint8_t* payload,
                    uint8_t payloadLength) {
  if (node == nullptr || node->shortAddress == 0U || payload == nullptr ||
      payloadLength == 0U) {
    return false;
  }

  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      (node->secureNwkSeen || node->currentNetworkKeySequence != 0U) &&
      networkKey != nullptr;

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kCommand;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              payload, payloadLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, payload, payloadLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

