lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void maybeExpirePendingApsAck(NodeEntry* node, uint32_t nowMs) {
  if (node == nullptr || !node->pendingApsAck ||
      static_cast<int32_t>(nowMs - node->pendingApsAckDeadlineMs) < 0) {
    return;
  }
  if (node->pendingApsAckRetriesRemaining > 0U && node->inFlight.used) {
    --node->pendingApsAckRetriesRemaining;
    const bool resent = sendApsFrameExtendedWithCounter(
        node->shortAddress, node->inFlight.deliveryMode,
        node->inFlight.destinationGroup, node->inFlight.destinationEndpoint,
        node->inFlight.clusterId, node->inFlight.profileId,
        node->inFlight.sourceEndpoint, node->inFlight.payload,
        node->inFlight.payloadLength, node->pendingApsAckCounter, false);
    if (resent) {
      node->pendingApsAckDeadlineMs = millis() + kApsAckTimeoutMs;
      Serial.print("aps_ack retry short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ctr=0x");
      Serial.print(node->pendingApsAckCounter, HEX);
      Serial.print(" remaining=");
      Serial.print(node->pendingApsAckRetriesRemaining);
      Serial.print("\r\n");
      return;
    }
  }
  Serial.print("aps_ack miss short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" ctr=0x");
  Serial.print(node->pendingApsAckCounter, HEX);
  Serial.print(" cluster=0x");
  Serial.print(node->pendingApsAckClusterId, HEX);
  Serial.print("\r\n");
  clearPendingApsAck(node);
}

bool sendApsFrameExtendedWithCounter(uint16_t destinationShort,
                                     uint8_t deliveryMode,
                                     uint16_t destinationGroup,
                                     uint8_t destinationEndpoint,
                                     uint16_t clusterId, uint16_t profileId,
                                     uint8_t sourceEndpoint,
                                     const uint8_t* payload,
                                     uint8_t payloadLength, uint8_t apsCounter,
                                     bool trackAck) {
  NodeEntry* node = findNodeByShort(destinationShort);
  const uint8_t keySequence =
      (node != nullptr && node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      (node != nullptr && node->secureNwkSeen && networkKey != nullptr);

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.deliveryMode = deliveryMode;
  aps.ackRequested = (deliveryMode == kZigbeeApsDeliveryUnicast);
  aps.destinationEndpoint = destinationEndpoint;
  aps.destinationGroup = destinationGroup;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = apsCounter;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        destinationShort, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  const bool sent = sendPsdu(psdu, psduLength);
  if (sent && trackAck) {
    rememberPendingApsAck(node, aps, payload, payloadLength);
  }
  return sent;
}

bool sendApsFrameExtended(uint16_t destinationShort, uint8_t deliveryMode,
                          uint16_t destinationGroup,
                          uint8_t destinationEndpoint, uint16_t clusterId,
                          uint16_t profileId, uint8_t sourceEndpoint,
                          const uint8_t* payload, uint8_t payloadLength) {
  return sendApsFrameExtendedWithCounter(destinationShort, deliveryMode,
                                         destinationGroup, destinationEndpoint,
                                         clusterId, profileId, sourceEndpoint,
                                         payload, payloadLength, g_apsCounter++,
                                         true);
}

bool sendApsAcknowledgement(NodeEntry* node, const ZigbeeApsDataFrame& request) {
  if (node == nullptr || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }

  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U)
          ? node->currentNetworkKeySequence
          : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  const bool useSecurity =
      node->secureNwkSeen && networkKey != nullptr;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool sendNwkRejoinResponse(NodeEntry* node, uint8_t status) {
  if (node == nullptr) {
    return false;
  }

  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildNwkRejoinResponseCommand(node->shortAddress, status,
                                                  payload, &payloadLength)) {
    return false;
  }
  return sendNwkCommand(node, payload, payloadLength);
}

