lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool sendUpdateDevice(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U || node->ieeeAddress == 0U) {
    return false;
  }
  if (!secureRejoinAllowed(node)) {
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  ZigbeeApsUpdateDevice updateDevice{};
  updateDevice.valid = true;
  updateDevice.deviceIeee = node->ieeeAddress;
  updateDevice.deviceShort = node->shortAddress;
  updateDevice.status = kZigbeeApsUpdateDeviceStatusStandardSecureRejoin;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader apsSecurity{};
  apsSecurity.valid = true;
  apsSecurity.securityControl = kZigbeeSecurityControlApsEncMic32;
  apsSecurity.frameCounter = g_apsTrustCenterFrameCounter++;
  apsSecurity.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsUpdateDeviceCommand(
          updateDevice, apsSecurity, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = true;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  ZigbeeNwkSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlNwkEncMic32;
  security.frameCounter = g_nwkSecurityFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  if (networkKey == nullptr) {
    return false;
  }
  security.keySequence = keySequence;
  if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                            apsFrame, apsLength, nwkFrame,
                                            &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool sendPendingAssociationResponse(NodeEntry* node) {
  if (node == nullptr || !node->pendingAssociationResponse) {
    return false;
  }

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  const bool built = ZigbeeCodec::buildAssociationResponse(
      g_macSequence++, kPanId, node->ieeeAddress, kCoordinatorShort,
      node->pendingAssignedShort, node->pendingAssociationStatus, frame, &length);
  if (!built) {
    return false;
  }
  const bool sent = sendPsdu(frame, length);
  if (sent) {
    node->pendingAssociationResponse = false;
    node->shortAddress = node->pendingAssignedShort;
    node->lastSeenMs = millis();
    if (node->pendingAssociationStatus == 0x00U) {
      if (node->pendingSecureRejoin && secureRejoinAllowed(node)) {
        Serial.print("assoc_rejoin short=0x");
        Serial.print(node->shortAddress, HEX);
        Serial.print("\r\n");
      } else {
        node->pendingSecureRejoin = false;
        (void)queuePendingTransportKey(node);
      }
    }
  }
  return sent;
}

bool sendPendingApsFrame(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  if (node->pendingTransportKey) {
    const bool sent = sendTransportKey(node);
    if (sent) {
      node->pendingTransportKey = false;
      if (node->pendingNetworkKeyUpdate) {
        node->pendingNetworkKeyUpdate = false;
        node->pendingSwitchKey = true;
      } else {
        node->currentNetworkKeySequence = g_activeNetworkKeySequence;
        node->lastInboundSecurityFrameCounter = 0U;
      }
    }
    return sent;
  }
  if (node->pendingSwitchKey) {
    const bool sent = sendSwitchKey(node);
    if (sent) {
      node->pendingSwitchKey = false;
      node->currentNetworkKeySequence = g_alternateNetworkKeySequence;
      node->lastInboundSecurityFrameCounter = 0U;
      maybePromoteAlternateNetworkKey();
    }
    return sent;
  }
  if (node->pendingSecureRejoin) {
    const bool sent = sendUpdateDevice(node);
    if (sent) {
      node->pendingSecureRejoin = false;
    }
    return sent;
  }
  if (!node->pending.used) {
    return false;
  }

  const bool sent =
      sendApsFrameExtended(node->shortAddress, node->pending.deliveryMode,
                           node->pending.destinationGroup,
                           node->pending.destinationEndpoint,
                           node->pending.clusterId, node->pending.profileId,
                           node->pending.sourceEndpoint, node->pending.payload,
                           node->pending.payloadLength);
  if (sent) {
    node->pending.used = false;
    node->pending.payloadLength = 0U;
  }
  return sent;
}

bool queueActiveEndpointsRequest(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoActiveEndpointsRequest(g_zdoSequence++,
                                                   node->shortAddress,
                                                   payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoActiveEndpointsRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    node->stage = NodeStage::kAwaitingActiveEndpoints;
  }
  return queued;
}

bool queueSimpleDescriptorRequest(NodeEntry* node, uint8_t endpoint) {
  if (node == nullptr || endpoint == 0U) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoSimpleDescriptorRequest(g_zdoSequence++,
                                                    node->shortAddress, endpoint,
                                                    payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoSimpleDescriptorRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    node->stage = NodeStage::kAwaitingSimpleDescriptor;
  }
  return queued;
}

bool queueBasicReadRequest(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U) {
    return false;
  }
  const uint16_t attributes[] = {0x0004U, 0x0005U, 0x0007U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildReadAttributesRequest(
          attributes,
          static_cast<uint8_t>(sizeof(attributes) / sizeof(attributes[0])),
          g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterBasic,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->stage = NodeStage::kAwaitingBasicRead;
  }
  return queued;
}

bool queueOnOffConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterOnOff;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kBoolean;
  configuration.minimumIntervalSeconds = 0U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 0U;

