lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterOnOff,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterOnOff;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueBindRequest(NodeEntry* node, uint16_t clusterId) {
  if (node == nullptr || node->endpoint == 0U || node->ieeeAddress == 0U) {
    return false;
  }

  uint8_t payload[32] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoBindRequest(
          g_zdoSequence++, node->ieeeAddress, node->endpoint, clusterId,
          ZigbeeBindingAddressMode::kExtended, 0U, kCoordinatorIeee,
          kCoordinatorEndpoint, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoBindRequest, kZigbeeProfileZdo, 0U,
                           0U, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = true;
    node->awaitingClusterId = clusterId;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueMgmtLeaveRequest(NodeEntry* node) {
  if (node == nullptr || node->ieeeAddress == 0U) {
    return false;
  }

  uint8_t payload[16] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoMgmtLeaveRequest(
          g_zdoSequence++, node->ieeeAddress, 0x00U, payload, &payloadLength)) {
    return false;
  }
  return queuePendingApsFrame(node, kZigbeeZdoMgmtLeaveRequest,
                              kZigbeeProfileZdo, 0U, 0U, payload,
                              payloadLength);
}

bool queueLevelConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterLevelControl;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kUint8;
  configuration.minimumIntervalSeconds = 0U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 16U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterLevelControl;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueTemperatureConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsTemperature) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterTemperatureMeasurement;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kInt16;
  configuration.minimumIntervalSeconds = 5U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 25U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterTemperatureMeasurement,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterTemperatureMeasurement;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queuePowerConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U ||
      !node->supportsPowerConfiguration) {
    return false;
  }

  ZigbeeReportingConfiguration configurations[2];
  memset(configurations, 0, sizeof(configurations));
  configurations[0].used = true;
  configurations[0].clusterId = kZigbeeClusterPowerConfiguration;
  configurations[0].attributeId = 0x0020U;
  configurations[0].dataType = ZigbeeZclDataType::kUint8;
  configurations[0].minimumIntervalSeconds = 30U;
  configurations[0].maximumIntervalSeconds = 300U;
  configurations[0].reportableChange = 1U;
  configurations[1].used = true;
  configurations[1].clusterId = kZigbeeClusterPowerConfiguration;
  configurations[1].attributeId = 0x0021U;
  configurations[1].dataType = ZigbeeZclDataType::kUint8;
  configurations[1].minimumIntervalSeconds = 30U;
  configurations[1].maximumIntervalSeconds = 300U;
  configurations[1].reportableChange = 2U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          configurations, 2U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterPowerConfiguration,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterPowerConfiguration;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueOnOffCommand(NodeEntry* node, uint8_t commandId) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff) {
    return false;
  }
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = commandId;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }
  return queuePendingApsFrame(node, kZigbeeClusterOnOff,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

