lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void handleAssociationRequest(const ZigbeeMacAssociationRequestView& request,
                              int8_t rssiDbm) {
  if (request.coordinatorPanId != kPanId ||
      request.coordinatorShort != kCoordinatorShort) {
    return;
  }
  if (!g_permitJoinEnabled) {
    Serial.print("assoc_drop reason=permit_join_closed ieee=0x");
    Serial.print(static_cast<uint32_t>(request.deviceExtended >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(request.deviceExtended & 0xFFFFFFFFUL),
                 HEX);
    Serial.print("\r\n");
    return;
  }

  NodeEntry* node = allocateNode(request.deviceExtended);
  if (node == nullptr) {
    Serial.print("assoc_drop reason=no_slot\r\n");
    return;
  }

  node->pending.used = false;
  node->pending.payloadLength = 0U;
  node->pendingTransportKey = false;
  node->pendingNetworkKeyUpdate = false;
  node->pendingSwitchKey = false;
  clearPendingApsAck(node);
  clearRecentInboundAps(node);
  if (node->shortAddress == 0U) {
    node->pendingAssignedShort = allocateShortAddress();
    node->secureNwkSeen = false;
    node->lastInboundSecurityFrameCounter = 0U;
    node->currentNetworkKeySequence = 0U;
    node->preconfiguredKeyMode = ZigbeePreconfiguredKeyMode::kNone;
    node->pendingSecureRejoin = false;
  } else {
    node->pendingAssignedShort = node->shortAddress;
    node->pendingSecureRejoin = secureRejoinAllowed(node);
    if (!node->pendingSecureRejoin) {
      node->secureNwkSeen = false;
      node->lastInboundSecurityFrameCounter = 0U;
      node->currentNetworkKeySequence = 0U;
    }
  }
  node->pendingAssociationStatus = 0U;
  node->pendingAssociationResponse = true;
  node->lastSeenMs = millis();

  Serial.print("assoc ieee=0x");
  Serial.print(static_cast<uint32_t>(request.deviceExtended >> 32U), HEX);
  Serial.print(static_cast<uint32_t>(request.deviceExtended & 0xFFFFFFFFUL), HEX);
  Serial.print(" assigned=0x");
  Serial.print(node->pendingAssignedShort, HEX);
  Serial.print(" rejoin=");
  Serial.print(node->pendingSecureRejoin ? "yes" : "no");
  Serial.print(" cap=0x");
  Serial.print(request.capabilityInformation, HEX);
  Serial.print(" rssi=");
  Serial.print(rssiDbm);
  Serial.print("dBm\r\n");
}

void handleDataRequest(const ZigbeeMacFrame& frame) {
  if (frame.source.mode != ZigbeeMacAddressMode::kExtended) {
    return;
  }

  NodeEntry* node = findNodeByIeee(frame.source.extendedAddress);
  if (node == nullptr) {
    return;
  }

  node->lastSeenMs = millis();
  if (node->pendingAssociationResponse) {
    const bool sent = sendPendingAssociationResponse(node);
    Serial.print("assoc_rsp ");
    Serial.print(sent ? "OK" : "FAIL");
    Serial.print(" short=0x");
    Serial.print(node->pendingAssignedShort, HEX);
    Serial.print("\r\n");
    return;
  }

  if (node->pending.used || node->pendingTransportKey ||
      node->pendingSecureRejoin || node->pendingSwitchKey) {
    const bool sent = sendPendingApsFrame(node);
    Serial.print("poll_deliver ");
    Serial.print(sent ? "OK" : "FAIL");
    Serial.print(" dst=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
  }
}

void handleOrphanNotification(const ZigbeeMacOrphanNotificationView& orphan,
                              int8_t rssiDbm) {
  NodeEntry* node = findNodeByIeee(orphan.deviceExtended);
  if (node == nullptr || node->shortAddress == 0U || !secureRejoinAllowed(node)) {
    return;
  }

  if (!sendCoordinatorRealignment(node)) {
    return;
  }

  node->pendingSecureRejoin = true;
  node->lastSeenMs = millis();
  Serial.print("orphan_realign short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" lk=");
  Serial.print(ZigbeeCommissioning::keyModeName(node->preconfiguredKeyMode));
  Serial.print(" rssi=");
  Serial.print(rssiDbm);
  Serial.print("dBm\r\n");
}

void handleNwkRejoinRequest(NodeEntry* node,
                            const ZigbeeNwkRejoinRequest& request) {
  if (node == nullptr || !request.valid) {
    return;
  }

  node->pendingSecureRejoin = secureRejoinAllowed(node);
  node->lastSeenMs = millis();
  const bool sent = sendNwkRejoinResponse(node, 0x00U);
  Serial.print("nwk_rejoin short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" cap=0x");
  Serial.print(request.capabilityInformation, HEX);
  Serial.print(" rsp=");
  Serial.print(sent ? "OK" : "FAIL");
  Serial.print("\r\n");
}

void handleEndDeviceTimeoutRequest(
    NodeEntry* node, const ZigbeeNwkEndDeviceTimeoutRequest& request) {
  if (node == nullptr || !request.valid) {
    return;
  }

  node->endDeviceTimeoutIndex = request.requestedTimeout;
  node->endDeviceConfiguration = request.endDeviceConfiguration;
  node->parentInformation =
      kZigbeeNwkParentInfoMacDataPollKeepalive |
      kZigbeeNwkParentInfoEndDeviceTimeoutSupported;
  node->endDeviceTimeoutNegotiated = true;
  const bool sent = sendEndDeviceTimeoutResponse(
      node, kZigbeeNwkEndDeviceTimeoutSuccess, node->parentInformation);
  Serial.print("end_device_timeout short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" req=0x");
  Serial.print(request.requestedTimeout, HEX);
  Serial.print(" rsp=");
  Serial.print(sent ? "OK" : "FAIL");
  Serial.print("\r\n");
}

void handleZdoFrame(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }

  if (aps.clusterId == kZigbeeZdoMgmtPermitJoinRequest) {
    uint8_t transactionSequence = 0U;
    uint8_t permitDurationSeconds = 0U;
    bool trustCenterSignificance = false;
    if (!ZigbeeCodec::parseZdoMgmtPermitJoinRequest(
            aps.payload, aps.payloadLength, &transactionSequence,
            &permitDurationSeconds, &trustCenterSignificance)) {
      return;
    }

    if (permitDurationSeconds == 0U) {
      g_permitJoinEnabled = false;
      g_permitJoinDeadlineMs = 0U;
    } else {
      g_permitJoinEnabled = true;
      g_permitJoinDeadlineMs =
          (permitDurationSeconds == 0xFFU)
              ? 0U
              : (millis() +
                 (static_cast<uint32_t>(permitDurationSeconds) * 1000UL));
    }

    Serial.print("mgmt_permit_join short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" duration_s=");
    Serial.print(permitDurationSeconds);
    Serial.print(" tc=");
    Serial.print(trustCenterSignificance ? "1" : "0");
    Serial.print("\r\n");

    const uint8_t responsePayload[2] = {transactionSequence, 0x00U};
    (void)sendApsFrame(node->shortAddress, 0U,
                       kZigbeeZdoMgmtPermitJoinResponse, kZigbeeProfileZdo, 0U,
                       responsePayload, sizeof(responsePayload));
    return;
  }

  if (aps.clusterId == kZigbeeZdoDeviceAnnounce && aps.payloadLength >= 12U) {
    const uint16_t announcedShort =
        static_cast<uint16_t>(aps.payload[1]) |
        (static_cast<uint16_t>(aps.payload[2]) << 8U);
    node->shortAddress = announcedShort;
    node->announced = true;
    Serial.print("device_announce short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ieee=0x");
    Serial.print(static_cast<uint32_t>(node->ieeeAddress >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(node->ieeeAddress & 0xFFFFFFFFUL), HEX);
    Serial.print("\r\n");
    if (node->endpoint == 0U) {
      (void)queueActiveEndpointsRequest(node);
    }
    return;
  }

