lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  if (aps.clusterId == kZigbeeZdoActiveEndpointsResponse) {
    ZigbeeZdoActiveEndpointsResponseView view{};
    if (!ZigbeeCodec::parseZdoActiveEndpointsResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U || view.endpointCount == 0U) {
      return;
    }

    node->endpoint = view.endpoints[0];
    Serial.print("active_ep short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(node->endpoint);
    Serial.print("\r\n");
    (void)queueSimpleDescriptorRequest(node, node->endpoint);
    return;
  }

  if (aps.clusterId == kZigbeeZdoBindResponse) {
    uint8_t transactionSequence = 0U;
    uint8_t status = 0xFFU;
    if (!ZigbeeCodec::parseZdoStatusResponse(aps.payload, aps.payloadLength,
                                             &transactionSequence, &status)) {
      return;
    }

    Serial.print("bind_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(node->awaitingClusterId, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");

    if (node->awaitingClusterId == kZigbeeClusterOnOff) {
      node->onOffBindingConfigured = true;
    } else if (node->awaitingClusterId == kZigbeeClusterLevelControl) {
      node->levelBindingConfigured = true;
    } else if (node->awaitingClusterId ==
               kZigbeeClusterTemperatureMeasurement) {
      node->temperatureBindingConfigured = true;
    } else if (node->awaitingClusterId == kZigbeeClusterPowerConfiguration) {
      node->powerBindingConfigured = true;
    }
    node->awaitingBindResponse = false;
    if (queueNextReportingStep(node)) {
      return;
    }
    node->stage = NodeStage::kReady;
    return;
  }

  if (aps.clusterId == kZigbeeZdoMgmtLeaveResponse) {
    uint8_t transactionSequence = 0U;
    uint8_t status = 0xFFU;
    if (!ZigbeeCodec::parseZdoStatusResponse(aps.payload, aps.payloadLength,
                                             &transactionSequence, &status)) {
      return;
    }

    Serial.print("leave_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");
    if (status == 0x00U) {
      memset(node, 0, sizeof(*node));
    }
    return;
  }

  if (aps.clusterId == kZigbeeZdoSimpleDescriptorResponse) {
    ZigbeeZdoSimpleDescriptorResponseView view{};
    if (!ZigbeeCodec::parseZdoSimpleDescriptorResponse(
            aps.payload, aps.payloadLength, &view) ||
        !view.valid || view.status != 0x00U) {
      return;
    }

    node->endpoint = view.endpoint;
    node->profileId = view.profileId;
    node->deviceId = view.deviceId;
    node->supportsOnOff = false;
    node->supportsLevelControl = false;
    node->supportsIdentify = false;
    node->supportsTemperature = false;
    node->supportsPowerConfiguration = false;
    node->onOffBindingConfigured = false;
    node->levelBindingConfigured = false;
    node->temperatureBindingConfigured = false;
    node->powerBindingConfigured = false;
    node->onOffReportingConfigured = false;
    node->levelReportingConfigured = false;
    node->temperatureReportingConfigured = false;
    node->powerReportingConfigured = false;
    node->awaitingBindResponse = false;
    node->awaitingClusterId = 0U;
    node->demoGroupConfigured = false;
    for (uint8_t i = 0U; i < view.inputClusterCount; ++i) {
      if (view.inputClusters[i] == kZigbeeClusterOnOff) {
        node->supportsOnOff = true;
      } else if (view.inputClusters[i] == kZigbeeClusterLevelControl) {
        node->supportsLevelControl = true;
      } else if (view.inputClusters[i] == kZigbeeClusterIdentify) {
        node->supportsIdentify = true;
      } else if (view.inputClusters[i] == kZigbeeClusterTemperatureMeasurement) {
        node->supportsTemperature = true;
      } else if (view.inputClusters[i] == kZigbeeClusterPowerConfiguration) {
        node->supportsPowerConfiguration = true;
      }
    }

    Serial.print("simple_desc short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(node->endpoint);
    Serial.print(" profile=0x");
    Serial.print(node->profileId, HEX);
    Serial.print(" device=0x");
    Serial.print(node->deviceId, HEX);
    Serial.print(" onoff=");
    Serial.print(node->supportsOnOff ? "yes" : "no");
    Serial.print(" level=");
    Serial.print(node->supportsLevelControl ? "yes" : "no");
    Serial.print(" temp=");
    Serial.print(node->supportsTemperature ? "yes" : "no");
    Serial.print("\r\n");

    if (!queueBasicReadRequest(node)) {
      node->stage = NodeStage::kReady;
    }
  }
}

void handleHaFrame(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }

  ZigbeeZclFrame zcl{};
  if (!ZigbeeCodec::parseZclFrame(aps.payload, aps.payloadLength, &zcl) ||
      !zcl.valid) {
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == 0x01U) {
    ZigbeeReadAttributeRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseReadAttributesResponse(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }
    applyReadAttributeState(node, aps.clusterId, records, recordCount);

    Serial.print("read_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" ");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print("attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(":");
      if (records[i].status == 0x00U) {
        printAttributeValue(records[i].value);
      } else {
        Serial.print("status=0x");
        Serial.print(records[i].status, HEX);
      }
      Serial.print(" ");
    }
    Serial.print("\r\n");

    if (aps.clusterId == kZigbeeClusterBasic) {
      node->basicRead = true;
      if (!queueNextReportingStep(node)) {
        node->stage = NodeStage::kReady;
      }
    }
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandConfigureReportingResponse) {
    Serial.print("cfg_reporting_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print("\r\n");
    if (aps.clusterId == kZigbeeClusterOnOff) {
      node->onOffReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterLevelControl) {
      node->levelReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterTemperatureMeasurement) {
      node->temperatureReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterPowerConfiguration) {
      node->powerReportingConfigured = true;
    }
    if (queueNextReportingStep(node)) {
      return;
    }
    node->stage = NodeStage::kReady;
    return;
  }

  if (aps.clusterId == kZigbeeClusterGroups &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific &&
      zcl.commandId == kGroupsCommandAddGroup && zcl.payloadLength >= 3U) {
    const uint8_t status = zcl.payload[0];
    const uint16_t groupId = static_cast<uint16_t>(zcl.payload[1]) |
                             (static_cast<uint16_t>(zcl.payload[2]) << 8U);
    if (status == 0x00U && groupId == kDemoGroupId) {
      node->demoGroupConfigured = true;
    }
    Serial.print("group_add_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" group=0x");
    Serial.print(groupId, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandReportAttributes) {
    ZigbeeAttributeReportRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseAttributeReport(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }
    applyReportedAttributeState(node, aps.clusterId, records, recordCount);

    Serial.print("report short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" ");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print("attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(":");
      printAttributeValue(records[i].value);
      Serial.print(" ");
    }
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandDefaultResponse && zcl.payloadLength >= 2U) {
    Serial.print("default_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cmd=0x");
    Serial.print(zcl.payload[0], HEX);
    Serial.print(" status=0x");
    Serial.print(zcl.payload[1], HEX);
    Serial.print("\r\n");
  }
}

