lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void processIncomingFrame(const ZigbeeFrame& frame) {
  ZigbeeMacFrame mac{};
  if (!ZigbeeCodec::parseMacFrame(frame.psdu, frame.length, &mac) || !mac.valid) {
    return;
  }

  if (mac.frameType == ZigbeeMacFrameType::kCommand) {
    if (mac.commandId == kZigbeeMacCommandBeaconRequest) {
      (void)sendBeacon();
      return;
    }

    ZigbeeMacOrphanNotificationView orphan{};
    if (ZigbeeCodec::parseOrphanNotification(frame.psdu, frame.length,
                                             &orphan)) {
      handleOrphanNotification(orphan, frame.rssiDbm);
      return;
    }

    ZigbeeMacAssociationRequestView association{};
    if (ZigbeeCodec::parseAssociationRequest(frame.psdu, frame.length,
                                             &association)) {
      handleAssociationRequest(association, frame.rssiDbm);
      return;
    }

    if (mac.commandId == kZigbeeMacCommandDataRequest &&
        mac.destination.mode == ZigbeeMacAddressMode::kShort &&
        mac.destination.panId == kPanId &&
        mac.destination.shortAddress == kCoordinatorShort) {
      handleDataRequest(mac);
      return;
    }
    return;
  }

  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != kPanId ||
      macData.destinationShort != kCoordinatorShort) {
    return;
  }

  NodeEntry* node = findNodeByShort(macData.sourceShort);
  if (node == nullptr) {
    return;
  }
  node->lastSeenMs = millis();

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  const uint8_t expectedKeySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* expectedKey = keyForSequence(expectedKeySequence);
  bool nwkValid = (expectedKey != nullptr) &&
                  ZigbeeSecurity::parseSecuredNwkFrame(
                      macData.payload, macData.payloadLength, expectedKey, &nwk,
                      &security, decryptedPayload, &decryptedPayloadLength);
  if (nwkValid &&
      (!security.valid || security.sourceIeee != node->ieeeAddress ||
       security.keySequence != expectedKeySequence ||
       security.frameCounter <= node->lastInboundSecurityFrameCounter)) {
    return;
  }
  if (!nwkValid) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != kCoordinatorShort) {
    return;
  }
  if (security.valid) {
    node->secureNwkSeen = true;
    node->lastInboundSecurityFrameCounter = security.frameCounter;
  }

  if (nwk.frameType == ZigbeeNwkFrameType::kCommand) {
    ZigbeeNwkRejoinRequest rejoinRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkRejoinRequestCommand(nwk.payload, nwk.payloadLength,
                                                  &rejoinRequest) &&
        rejoinRequest.valid) {
      handleNwkRejoinRequest(node, rejoinRequest);
      return;
    }

    ZigbeeNwkEndDeviceTimeoutRequest timeoutRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkEndDeviceTimeoutRequestCommand(
            nwk.payload, nwk.payloadLength, &timeoutRequest) &&
        timeoutRequest.valid) {
      handleEndDeviceTimeoutRequest(node, timeoutRequest);
      return;
    }
    return;
  }

  ZigbeeApsDataFrame aps{};
  ZigbeeApsAcknowledgementFrame ack{};
  if (ZigbeeCodec::parseApsAcknowledgementFrame(nwk.payload, nwk.payloadLength,
                                                &ack) &&
      ack.valid) {
    if (matchesPendingApsAck(*node, ack)) {
      Serial.print("aps_ack short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ctr=0x");
      Serial.print(ack.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(ack.clusterId, HEX);
      Serial.print("\r\n");
      clearPendingApsAck(node);
    }
    return;
  }
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    return;
  }

  const uint32_t nowMs = millis();
  const bool duplicateAps = isRecentInboundApsDuplicate(node, aps, nowMs);

  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    (void)sendApsAcknowledgement(node, aps);
  }

  if (aps.profileId == kZigbeeProfileZdo) {
    if (duplicateAps) {
      Serial.print("aps_dup short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(node, aps);
    handleZdoFrame(node, aps);
    return;
  }
  if (aps.profileId == kZigbeeProfileHomeAutomation) {
    if (duplicateAps) {
      Serial.print("aps_dup short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(node, aps);
    handleHaFrame(node, aps);
  }
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if (ch == 'b') {
      const bool sent = sendBeacon();
      Serial.print("beacon ");
      Serial.print(sent ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'l') {
      listNodes();
    } else if (ch == 'p') {
      g_permitJoinEnabled = true;
      g_permitJoinDeadlineMs = millis() + kPermitJoinWindowMs;
      Serial.print("permit_join open ms=");
      Serial.print(kPermitJoinWindowMs);
      Serial.print("\r\n");
    } else if (ch == 'x') {
      g_permitJoinEnabled = false;
      g_permitJoinDeadlineMs = 0U;
      Serial.print("permit_join closed\r\n");
    } else if (ch == 'd') {
      NodeEntry* node = firstJoinedNode();
      const bool queued = (node != nullptr) && queueActiveEndpointsRequest(node);
      Serial.print("discover ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'v') {
      NodeEntry* node = firstJoinedNode();
      const bool queued = (node != nullptr) && queueMgmtLeaveRequest(node);
      Serial.print("queue_leave ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'k') {
      const bool queued = queueNetworkKeyUpdateRollout();
      Serial.print("queue_key_update ");
      Serial.print(queued ? "OK" : "FAIL");
      if (g_haveAlternateNetworkKey) {
        Serial.print(" seq=");
        Serial.print(g_alternateNetworkKeySequence);
      }
      Serial.print("\r\n");
    } else if (ch == 't' || ch == 'o' || ch == 'f') {
      NodeEntry* node = firstOnOffNode();
      uint8_t commandId = kOnOffCommandToggle;
      if (ch == 'o') {
        commandId = kOnOffCommandOn;
      } else if (ch == 'f') {
        commandId = kOnOffCommandOff;
      }
      const bool queued = (node != nullptr) && queueOnOffCommand(node, commandId);
      Serial.print("queue_cmd ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'U' || ch == 'D' || ch == 'M') {
      NodeEntry* node = firstLevelNode();
      bool queued = false;
      if (ch == 'U') {
        queued = (node != nullptr) && queueLevelStep(node, true, 32U);
      } else if (ch == 'D') {
        queued = (node != nullptr) && queueLevelStep(node, false, 32U);
      } else {
        queued = (node != nullptr) && queueLevelMoveToLevel(node, 128U);
      }
      Serial.print("queue_level ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'g') {
      const bool queued = queueDemoGroupEnrollment();
      Serial.print("queue_group_enroll ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    } else if (ch == 'O' || ch == 'F' || ch == 'T') {
      uint8_t commandId = kOnOffCommandToggle;
      if (ch == 'O') {
        commandId = kOnOffCommandOn;
      } else if (ch == 'F') {
        commandId = kOnOffCommandOff;
      }
      const bool queued = queueDemoGroupOnOff(commandId);
      Serial.print("queue_group_cmd ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    } else if (ch == '+' || ch == '-' || ch == 'm') {
      bool queued = false;
      if (ch == '+') {
        queued = queueDemoGroupLevelStep(true, 32U);
      } else if (ch == '-') {
        queued = queueDemoGroupLevelStep(false, 32U);
      } else {
        queued = queueDemoGroupLevelMoveToLevel(128U);
      }
      Serial.print("queue_group_level ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    }
  }
}

